shell/delta_diff/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-11-13 Wed 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>todo for multi_scale</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content">
<h1 class="title">todo for multi_scale</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga78b3ad">1. link</a></li>
<li><a href="#orgf50f6e2">2. install</a></li>
<li><a href="#orgf4965bf">3. options</a></li>
<li><a href="#orgc56b5a3">4. brewからのinstall<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-11-13 Wed&gt;</span></span></a></li>
</ul>
</div>
</div>

<div id="outline-container-orga78b3ad" class="outline-2">
<h2 id="orga78b3ad"><span class="section-number-2">1</span> link</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://github.com/dandavison/delta">https://github.com/dandavison/delta</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf50f6e2" class="outline-2">
<h2 id="orgf50f6e2"><span class="section-number-2">2</span> install</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>brew install git-delta</li>
<li>sudo apt install git-delta  # on Ubuntu : error 無いって
<ul class="org-ul">
<li><a href="https://dandavison.github.io/delta/installation.html">https://dandavison.github.io/delta/installation.html</a></li>
<li><a href="https://github.com/dandavison/delta/issues/504">https://github.com/dandavison/delta/issues/504</a>
<ul class="org-ul">
<li>Cannot install package on Ubuntu 19.10 and earlier due to libgcc-s1</li>
<li>tl;dr if you're on an older version of Ubuntu (19.10 and earlier) or Debian (10 and earlier):</li>
<li>うまくcompileできてないんでしょうね<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-10-31 Thu&gt;</span></span></li>
<li>brewからのinstallを参照<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-11-13 Wed&gt;</span></span></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf4965bf" class="outline-2">
<h2 id="orgf4965bf"><span class="section-number-2">3</span> options</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>&#x2013;light &#x2013;side-by-side</li>
</ul>
</div>
</div>

<div id="outline-container-orgc56b5a3" class="outline-2">
<h2 id="orgc56b5a3"><span class="section-number-2">4</span> brewからのinstall<span class="timestamp-wrapper"><span class="timestamp">&lt;2024-11-13 Wed&gt;</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>どうしても入れたい時</li>
<li><code>sudo apt-get install build-essential curl file git</code></li>
<li><code>/bin/bash -c "(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)"</code></li>
</ul>
<p>
bashでやったほうがいいかも
</p>
<ul class="org-ul">
<li><code>bash</code></li>
<li><code>/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install.sh)"</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">&gt; tail -1  ~/.config/fish/config.fish 

<span style="color: #483d8b;">eval</span> (/home/linuxbrew/.linuxbrew/bin/brew shellenv)
</pre>
</div>

<ul class="org-ul">
<li><code>brew install git-delta</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-11-13 Wed 14:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
